{"data":{"site":{"siteMetadata":{"title":"Zero1's Note","author":"Zero1","siteUrl":"https://github.com/2Zero1","comment":{"disqusShortName":"2Zero1","utterances":"2Zero1 Blog"},"sponsor":{"buyMeACoffeeId":"jbee"}}},"markdownRemark":{"id":"bd35f40a-92c7-549f-bd77-2fa6943fdeca","excerpt":"좀 늦은 감이 있는 작년의 회고를 작성해 보려고 한다.\n작년에는 비사이드소프트로 입사도 했고 코로나로 인해 생활의 많은 것들이 바뀌게 되었다. 코로나로 인해 활동적인 성격도 조금 변화된것 같고 물론 나이가 들면서 영향을 받은게 있게지만… 친구들도 많이 만나지 못하고 받은 월급은 차곡차곡 쌓아왔다.\n이전과 동일하게 202…","html":"<p>좀 늦은 감이 있는 작년의 회고를 작성해 보려고 한다.\n작년에는 비사이드소프트로 입사도 했고 코로나로 인해 생활의 많은 것들이 바뀌게 되었다. 코로나로 인해 활동적인 성격도 조금 변화된것 같고 물론 나이가 들면서 영향을 받은게 있게지만… 친구들도 많이 만나지 못하고 받은 월급은 차곡차곡 쌓아왔다.\n이전과 동일하게 2020년에도 좋았던 일들과 후회스러운 일들이 함께 있었고 이것에 대해 글을 작성해보려고 한다.</p>\n<p>좋았던것과 후회되었던 것을 간단하게 말해보자면 좋았던 것은 입사로 인해 실제 소프트웨어가 만들어 지는 과정과 그 과정에 내가 참여해 최상위 품질의 소프트웨어를 만들어 본 경험과 진짜 공부를 해보았다는 것이다. 단지 책을 읽는 것이 공부한게 아니라 안되는 것을 되게 훈련하고 어려운걸 하는것이 공부라는 것을..</p>\n<p>또 아쉬웠던 점은 내가 입사한 회사의 문화가 나와는 맞지 않다는 느낌을 받고 그것이 나의 일의 즐거움에 영향을 끼치고 있다고 생각이 든다는 것이다. 내가 소심한 성격 탓인건지 회사가 권위적이지 않다지만 권위를 느끼고 있는것 같다. 이렇게 생각하게 된 이유는 지금 회사도 배우기에 최고의 회사라고 생각하지만, 회사의 분위기와 혼자 공부한다는 외로움에서 인지 몰라도 지인의 이직 제안을 긍정적으로 생각하고 있다는 것이다. 즉흥적으로 생각해서 결정하기 보단 시간을 두고 어떤것이 나에게 더 이로울지 고민해보겠지만..\n또 다른 아쉬웠던 점은 너무 달려온 나머지 뒤를 돌아보고 생각해보지 않았다는 점이다. 작년 초부터 시작했었던 회고도 남기지 않았고, 공부했던 것을 정리하지도 않았다. 그러다 보니 사실 내가 무엇을 했는지 잘 모르겠다. 물론 나의 몸이 기억 하겠지만 이전 처럼 잘 정리해야겠다는 생각이 든다.</p>\n<p>나는 함께 일하고 함께 공부하는걸 좋아한다고 느꼈다. 입사 전에 같이 공부했었던 사람들이 아직도 같이 공부하는 것을 보며 부러움을 느끼게 되었다. 마침 그런 분위기의 회사로 부터 이직 제안이 와서 긍정적으로 생각하게 된다. 어떻게 보면 나도 권위주의적인게 있지 않나 싶다. 나도 나를 살펴보지 않고 그냥 목표에 가기 위해 다른 사람들이 사용하는 방법으로 채찍질을 가하며 내가 어떤 상태인지는 살피지 않는다. 하지만 내가 나를 좀 더 살피고 나의 기분이나 상태에 좀 더 신경을 썼더라면 좀 더 좋은 공부 효율을 내거나 지금까지 받았던 상처를 받을 필요가 없지 않았을까?</p>\n<p>다사 다난 했었던 2020년도 였지만 좋은것도 많았고 후회한 것도 많았다. 이번년도에는 후회한 것들보다 내가 좋았던 것이 많은 해가될 수 있도록 계획하고 실행하고 관찰하며 뒤돌아보는 삶을 살아야겠다.</p>","frontmatter":{"title":"2021-01-16 회고","date":"January 16, 2021"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/til/2021-01-16/","previous":{"fields":{"slug":"/til/2020-05-21/"},"frontmatter":{"title":"2020-05-21 TIL","category":"TIL"}},"next":{"fields":{"slug":"/study/코어자바 3장/"},"frontmatter":{"title":"코어자바 3장","category":"java"}}}}